clear
echo -e "\033[0;32m ███╗░░░███╗░░░░░░████████╗░█████╗░░█████╗░██╗░░░░░
 ████╗░████║░░░░░░╚══██╔══╝██╔══██╗██╔══██╗██║░░░░░
 ██╔████╔██║█████╗░░░██║░░░██║░░██║██║░░██║██║░░░░░
 ██║╚██╔╝██║╚════╝░░░██║░░░██║░░██║██║░░██║██║░░░░░
 ██║░╚═╝░██║░░░░░░░░░██║░░░╚█████╔╝╚█████╔╝███████╗
 ╚═╝░░░░░╚═╝░░░░░░░░░╚═╝░░░░╚════╝░░╚════╝░╚══════╝"
echo
echo -e "\033[0;31m Skripty ýasan 𝑨𝒎𝒂𝒏𝒐𝒇𝒇 𝑶𝒇𝒇𝒊𝒄𝒊𝒂𝒍"
echo
echo -e "\033[0;31m Python alynýar"
echo
pkg install python -y
echo
echo -e "\033[0;31m NodeJS alynýar"
echo
pkg install nodejs -y
echo
echo -e "\033[0;31m Cryptography alynýar"
echo
pkg install python-cryptography
echo
echo -e "\033[0;31m Pycryptodome alynýar"
echo
pip install pycryptodome 
echo
echo -e "\033[0;31m Update edilýär"
echo
pkg update
echo
echo -e "\033[0;31m Upgrade edilýär"
echo
pkg upgrade
echo
echo -e "\033[0;33m Skripte gerekli zatlar üstinlikli alyndy! Skripty işletmek üçin python MTools.py"
echo -e "\033[0;33m ⚠️Eger pycryptodome alynmasa käbir kodlar işlemez⚠️"